# ══════════════════════════════════════════════════════
# Homebrew Bundle
# ══════════════════════════════════════════════════════
# Install: brew bundle --file=Brewfile

# ── Taps ──
tap "homebrew/bundle"

# ── Core CLI Tools ──
brew "git"
brew "gh"

# ── Modern CLI Replacements ──
brew "bat"          # cat replacement with syntax highlighting
brew "eza"          # ls replacement with icons & git integration
brew "fd"           # find replacement, simple & fast
brew "ripgrep"      # grep replacement, blazing fast
brew "fzf"          # fuzzy finder for everything
brew "zoxide"       # cd replacement, learns your habits
brew "git-delta"    # beautiful git diffs
brew "btop"         # top replacement, beautiful system monitor
brew "tldr"         # simplified man pages

# ── Shell & Prompt ──
brew "starship"     # cross-shell prompt
brew "atuin"        # magical shell history

# ── Development Tools ──
brew "lazygit"      # terminal UI for git
brew "yq"           # jq for YAML

# ── Runtime Management ──
# mise is installed via its own installer (see install.sh)

# ── Casks ──
cask "font-jetbrains-mono-nerd-font"   # JetBrains Mono with Nerd Font icons
